src/cf/mdm/InformationRegisters/НастройкиОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВиртуальныйХост</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочкаОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяОчереди</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлючМаршрутизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбмена</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/mdm/InformationRegisters/НастройкиОбмена/Ext/ManagerModule.bsl
Функция ПолучитьПараметрыОбмена(ВидОбмена) Экспорт
	
	ПараметрыОбмена = ИнициализироватьСтруктуруПараметров();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиОбмена.Адрес КАК Адрес,
		|	НастройкиОбмена.Порт КАК Порт,
		|	НастройкиОбмена.Логин КАК Логин,
		|	НастройкиОбмена.Пароль КАК Пароль,
		|	НастройкиОбмена.ВиртуальныйХост КАК ВиртуальныйХост,
		|	НастройкиОбмена.ТочкаОбмена КАК ТочкаОбмена,
		|	НастройкиОбмена.ИмяОчереди КАК ИмяОчереди,
		|	НастройкиОбмена.КлючМаршрутизации КАК КлючМаршрутизации
		|ИЗ
		|	РегистрСведений.НастройкиОбмена КАК НастройкиОбмена
		|ГДЕ
		|	НастройкиОбмена.ВидОбмена = &ВидОбмена";
	
	Запрос.УстановитьПараметр("ВидОбмена", ВидОбмена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
    ЗаполнитьЗначенияСвойств(ПараметрыОбмена, ВыборкаДетальныеЗаписи); 
	
	Возврат ПараметрыОбмена;
	
Конецфункции 

Функция ИнициализироватьСтруктуруПараметров()

	СтруктуруПараметров = Новый Структура();
	СтруктуруПараметров.Вставить("Адрес", "");  
	СтруктуруПараметров.Вставить("Порт", "");
	СтруктуруПараметров.Вставить("Логин", "");
	СтруктуруПараметров.Вставить("Пароль", "");
	СтруктуруПараметров.Вставить("ВиртуальныйХост", "");
	СтруктуруПараметров.Вставить("ТочкаОбмена", "");
	СтруктуруПараметров.Вставить("ИмяОчереди", "");
	СтруктуруПараметров.Вставить("КлючМаршрутизации", "");
	
	Возврат СтруктуруПараметров;
	
Конецфункции
